test/testData/dummy_event.json

{"event":"payment.captured","created_at":1535726894,"environment":"live","contains":["payment"],"payload":{"payment":{"id":"pay_jSPE7Ua4lsaJmCWE","object":"payment","amount":100,"currency":"INR","status":"captured","order_id":"order_H9XnCs7plrqJ73An","international":false,"method":"card","description":"Bhairab Ganguly College","card":"visa-credit","bank":"","wallet":"","vpa":"","emi":null,"email":"ishita.nandi@payabbhi.com","contact":"+919231480534","notes":{"Address":121.1,"Name":"Manual Checkout"},"fee":0,"service_tax":0,"payout_amount":0,"payout_type":"","refunded_amount":0,"refund_status":"","refunds":{"total_count":0,"object":"list","data":[]},"error_code":"","error_description":"","created_at":1535726866}}}
